cmsis-svd/cmsis-svd/data/Infineon/psoc4200l.svd
        <register>
          <name>PWR_DFT_SELECT</name>
          <description>Power DFT Mode Selection Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3880000</resetValue>
          <resetMask>0xFFDFFFFF</resetMask>
          <fields>
            <field>
              <name>TVMON1_SEL</name>
              <description>Select source for PWRSYS ADFT output #1:
0: not connected (default)
1: vnwell
2: vccq
3: vccd_sw
4: vcclfclk
5: vcchib
6: vccdpslp
7: vccqr</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TVMON2_SEL</name>
              <description>Select source for PWRSYS ADFT output #2:
0: not connected (default)
1: not connected
2: Boot Reference biasn
3: Boot Reference nprot
4: DO NOT USE.  Unsafely diode couples vccd_sw to bootref 800mV reference.
5: Boot Reference 800mv
6: not connected
7: not connected</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS</name>
              <description>Forces regulator into bypass mode.  Disables active mode regulator and allows most switches and other regulators to be manually controlled though other bits in this register..</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ACTIVE_EN</name>
              <description>Force active regulator on.  Only works when BYPASS=1.  Intended for characterization and testing.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ACTIVE_INRUSH_DIS</name>
              <description>Force disable of active regulator inrush current limiter.  Only works when BYPASS=1.  Intended for characterization and testing.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LPCOMP_DIS</name>
              <description>When set disables the LPCOMP.  Only do this when the LPCOMP outputs are properly bypassed using the POWER_UP_* bits and also PWR_DFT_KEY.DFT_MODE=1.  Only works when BYPASS=1.  Intended for LPCOMP testing.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEED_EN</name>
              <description>When set enables bleeder cells on various switched power nets to accelerate discharge during retention testing.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IPOR_EN</name>
              <description>Force IPOR_EN signal high.  Only works when BYPASS=1.  Intended for IPOR/HVPOR IDDQ testing.  You must bypass the IO cells using PWR_DFT_KEY.IO_DISABLE_BYPASS and .KEY16 before setting this bit.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>POWER_UP_RAW_BYP</name>
              <description>When set, the LPCOMP output is controllable by POWER_UP_RAW_CTL.  Only works when BYPASS=1.  Intended for testing quiet regulator delayline, active regulator, and hibernate/deepsleep regulator.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>POWER_UP_RAW_CTL</name>
              <description>Value to force onto power_up_raw_hv.  Only works when POWER_UP_RAW_BYP=1.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DEEPSLEEP_EN</name>
              <description>Force DeepSleep Regulator on.  Only works when BYPASS=1.  Intended for DeepSleep Regulator IDDQ testing.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD_BYPASS</name>
              <description>N/A</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NWELL_OPEN</name>
              <description>Force switch between Vnwell and Vcchib open.  Only works when BYPASS=1.  Intended for IDDQ testing.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HIBERNATE_OPEN</name>
              <description>Force switch between Vcchib and Vccdpslp open.  Only works when BYPASS=1, PWR_DFT_KEY.KEY16 is set to the key, and PWR_DFT_KEY.DFT_MODE=1.  Intended for IDDQ testing.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DEEPSLEEP_OPEN</name>
              <description>Force switch between Vccdpslp and Vccd open.  Only works when BYPASS=1.  Intended for IDDQ testing.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>QUIET_OPEN</name>
              <description>Force switch between Vccq and Vccdpslp open.  Only works when BYPASS=1.  Intended for IDDQ testing.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LFCLK_OPEN</name>
              <description>Force switch between Vcclfclk and Vccdpslp open.  Only works when BYPASS=1.  Intended for IDDQ testing.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>QUIET_EN</name>
              <description>Force Vccq regulator on/off.  Only works when BYPASS=1.  Intended for IDDQ testing.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BREF_EN</name>
              <description>Enables the boot reference currents.  Do not clear this bit unless he active regulator, quiet regulator, or LPCOMP are bypassed.  Only works when BYPASS=1.  Intended for characterization and testing.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BREF_OUTEN</name>
              <description>Enables the output stage of the LDO reference selector. Do not clear this bit when the active regulator is operating.  Only works when BYPASS=1.  Intended for characterization and testing.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BREF_REFSW</name>
              <description>Controls the power system reference source
0: boot reference
1: Low voltage bandgap (LVBG)
Using the LVBG reference improves PSRR. Only works when BYPASS=1.  Intended for characterization and testing.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BREF_TESTMODE</name>
              <description>Puts the bootref in testmode.  Intended for characterization and testing.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>NWELL_DIS</name>
              <description>Controls the vnwell level during deep sleep and hibernate.  When set, the nwell regulator is disabled.  When this bit is set, the Vnwell  rail will be shorted to Vcchib rail (nwell_short).</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HVMON_DFT_OVR</name>
              <description>Overrides the trim values coming from NVLatches to the values stored in the HV Monitor.  Allows char &amp; test of the NVLatches without disturbing trims.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IMO_REFGEN_DIS</name>
              <description>Disables the IMO reference generator to allow testing the current references.  A side-effect of setting this bit is that the SRSS outputs vbias_ptat and vbias_casc_ptat are shorted to vccq.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>POWER_UP_ACTIVE</name>
              <description>When set, forces pwrgood=1 for active regulator.  Combined with POWER_UP_RAW_CTL=0, this gives full control on this input for characterization and testing.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>POWER_UP_HIBDPSLP</name>
              <description>When set, forces pwrg_actdig=1 for hibernate/deepsleep circuits.  Combined with POWER_UP_RAW_CTL=0, this gives full control on this input for characterization and testing.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_DDFT_SELECT</name>
          <description>Digital DFT Select</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>DDFT1_SEL</name>
              <description>Signal select for ddft1 output:
0: wakeup_a
1: ipor_reset
2: hbod_reset_raw_n
3: lpcomp_dis
4: power_up_delayed
5: awake
6: hvmon_out_of_sync
7: pbod_reset
8: hvbod_reset
9: lpm_ready
10: io_disable_req_lv (excluding por_force_in_hv)
11: bootref_en</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DDFT2_SEL</name>
              <description>Signal select for ddft2 output:
0: act_power_en_a
1: power_up_raw
2: act_power_good_a
3: fastrefs_valid
4: vmon
5: bootref_outen
6: bootref_refsw
7: active_inrush_dis
8: awake
9: hvpor_reset_n
10: lpcomp_dis
11: wakeup_a
12: vmon_valid
13: block_rst_awake
14: slpholdreq_n
15: io_disable_delayed</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_DFT_KEY</name>
          <description>DFT Safety Override</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1FFFFF</resetMask>
          <fields>
            <field>
              <name>KEY16</name>
              <description>This field must be set to 0xE4C5 for any of the other fields in this register to have effect and for scan_mode to be allowed.  When this fields has any other value, all other fields in this register are ignored and assumed to be 0 by the hardware, and scan_mode is ignored inside the power generation system.  It is assumed that this register will always be set to 0xE4C5 before entering scan.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HBOD_OFF_AWAKE</name>
              <description>Forces the output of the HBOD to be blocked (ignored) while in Active or Sleep mode (i.e. when under the umbrella of PBOD).</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BODS_OFF</name>
              <description>Forces all outputs of BOD detectors to be ignored, effectively disabling all brown-out detection.  Can be used in conjunction with DDFT to test the detectors without triggering reset.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DFT_MODE</name>
              <description>Enable DfT modes other than the above.  Currently gates power_up comparator for characterization.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IO_DISABLE_BYPASS</name>
              <description>Bypasses the IO disable logic for testing the delay-line that is part of the glitch-free IO reset circuitry.  Internally, prevents the outputs from getting disabled (io_disable_req_hv=0) and blocks resets (io_disable_ack_hv=0).  The delay-line continues to function and can be routed to DDFT for testing.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VMON_PD</name>
              <description>Disables the VMON block, which includes PBOD, HVBOD, and LVD circuits.  Set BODS_OFF=1 in a previous write cycle to prevent an unintended reset.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_BOD_KEY</name>
          <description>BOD Detection Key</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>KEY16</name>
              <description>To detect brown-outs firmware should do this on boot:
1. Set key= KEY16
2. Set KEY16= 0x3A71
3. If key==0x3A71 this was a brown-out event.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PWR_STOP</name>
          <description>STOP Mode Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x8003FFFF</resetMask>
          <fields>
            <field>
              <name>TOKEN</name>
              <description>Contains a 8-bit token that is retained through a STOP/WAKEUP sequence that can be used by firmware to differentiate WAKEUP from a general RESET event.  Note that waking up from STOP using XRES will reset this register.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UNLOCK</name>
              <description>This byte must be set to 0x3A for FREEZE or STOP fields to operate.  Any other value in this register will cause FREEZE/STOP to have no effect, except as noted in the FREEZE description.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>POLARITY</name>
              <description>0: WAKEUP=0 will wakeup the part from STOP
1: WAKEUP=1 will wakeup the part from STOP</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FREEZE</name>
              <description>Firmware sets this bit to freeze the configuration, mode and state of all GPIOs and SIOs in the system.  Two identical write cycles are required to freeze the IO explicitly.  The first cycle instructs DEEPSLEEP and HIBERNATE peripherals whether they can override upcoming freeze command(s).  UNLOCK setting does not affect this.  If firmware writes FREEZE=1 and STOP=0, peripherals can override the freeze and remain functional according to their configuration.  If firmware writes FREEZE=1 and STOP=1, peripherals cannot override the next freeze command.  The second write cycle freezes the IO if UNLOCK is set and the peripheral does not override the freeze.  While FREEZE=1, peripherals will automatically freeze according to the override directive when entering DEEPSLEEP or HIBERNATE, regardless of the UNLOCK setting.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STOP</name>
              <description>Firmware sets this bit to enter STOP mode.  Both UNLOCK and FREEZE must have been set correctly in a previous write operation.  Otherwise, writes to this bit will affect the freeze override but will not actually set the STOP bit.  The system will enter STOP mode immediately after writing to this bit and will wakeup only in response to XRES or WAKEUP event.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
