cmsis-svd/cmsis-svd/data/Infineon/psoc4200l.svd
        <register>
          <name>PLL1_CONFIG</name>
          <description>PLL #1 Configuration Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20000</resetValue>
          <resetMask>0xC037FFFF</resetMask>
          <fields>
            <field>
              <name>FEEDBACK_DIV</name>
              <description>Control bits for feedback divider: Valid divide is 8-256.  Do not change while PLL output is selected.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REFERENCE_DIV</name>
              <description>Control bits for reference divider: Divide by 2=0001, ..., divide by 64=111111.  Do not change while PLL output is selected.</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTPUT_DIV</name>
              <description>Control bits for Output divider.  Do not change while PLL output is selected.</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PASS</name>
                  <description>Pass Through</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>Divide by 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>Divide by 4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>Divide by 8</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICP_SEL</name>
              <description>Programmable charge pump current between 0uA and 7uA.  Do not change while the PLL output is selected.  For functional operation, the value must be set according to the PLL output frequency Fout (measured before the output divider):
0: 0uA (Hi-Z) Engineering use only
1: 1uA. Engineering use only
2: 2uA. Use when Fout &lt;= 67MHz
3: 3uA. Use when Fout &gt; 67MHz
4-7: 4uA-7uA.  Engineering use only</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_SEL</name>
              <description>Selects the source of the system PLL1 clock.</description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUTO</name>
                  <description>Automatic using lock indicator.  When unlocked, automatically selects PLL reference input (bypass mode).  When locked, automatically selects PLL output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTO1</name>
                  <description>Same as AUTO</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_REF</name>
                  <description>Select PLL reference input (bypass mode).  Ignores lock indicator</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL_OUT</name>
                  <description>Select PLL output.  Ignores lock indicator.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISOLATE_N</name>
              <description>Isolation control of PLL outputs.  This also internally resets the PLL.  De-assert &gt;= 5us after ENABLE=1.  Assertion can happen in same write as ENABLE=0.  Do not change while PLL output is selected.
0: Isolate outputs; Precharge PLL control voltage if PLL0_TEST.FAST_LOCK_EN is set to 1.
1: Do not isolate outputs</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Master enable for PLL power gate.  Refer to ISOLATE_N field for required sequencing.
0: Block is powered off
1: Block is powered on</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL1_STATUS</name>
          <description>PLL #1 Status Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>LOCKED</name>
              <description>PLL Lock Indicator</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL1_TEST</name>
          <description>PLL #1 Test Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8</resetValue>
          <resetMask>0x1F</resetMask>
          <fields>
            <field>
              <name>TEST_MODE</name>
              <description>Test Mode</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal Operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_VC_LKG</name>
                  <description>Vcontrol Leakage Test Mode
Measure frequency drift over time to indirectly measure leakage on Vcontrol</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_CP_DN</name>
                  <description>Charge Pump Down Current Test Mode
With ICPSEL&gt;0, directly measure charge pump up current on Vcontrol
With ICPSEL=0, directly measure leakage on Vcontrol
With ICPSEL=0, FAST_LOCK_EN=0 and ISOLATE_N=0, directly measure discharge current on Vcontrol
With ICPSEL=0, FAST_LOCK_EN=1 and ISOLATE_N=0, directly measure precharge current on Vcontrol</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_CP_UP</name>
                  <description>Charge Pump Up Current Test Mode
With ICPSEL&gt;0, directly measure charge pump up current on Vcontrol
With ICPSEL=0, directly measure leakage on Vcontrol
With ICPSEL=0, FAST_LOCK_EN=0 and ISOLATE_N=0, directly measure discharge current on Vcontrol
With ICPSEL=0, FAST_LOCK_EN=1 and ISOLATE_N=0, directly measure precharge current on Vcontrol</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USER_EXT_FL</name>
                  <description>User Mode with Extended Fast Lock Precharge</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_CTR_PQ</name>
                  <description>Reference and Feedback Counter Test Mode</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_LD_DLY</name>
                  <description>Lock Detector Delay Line Test Mode</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_CTR_ALT</name>
                  <description>Lock Detector Wait and Extended Fast Lock Counter Test Mode
With ICPSEL=0 and Reference Clock stopped directly measure precharge current on Vcontrol
With ICPSEL=0 and Reference Clock running directly measure leakage on Vcontrol</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FAST_LOCK_EN</name>
              <description>Fast Lock Enable - Speeds up the lock time when set to 1.  When ISOLATE_N is high, the PLL control voltage will be precharged to reduce time spent acquiring frequency lock.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UNLOCK_OCCURRED</name>
              <description>This bit sets whenever the PLL Lock bit goes low, and stays set until cleared by firmware. This is a diagnostic bit used for char and validation.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPLL_CONFIG</name>
          <description>DPLL Configuration Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x80000303</resetMask>
          <fields>
            <field>
              <name>REF_DIV2_EN</name>
              <description>Divide input reference by 2 before double synchronizing to input clock.  Use this option when the pulse length of the input reference is not guaranteed to be at least 2x the cycle time of the selected input clock (for example when using trigger signals or other short-pulse-type signals).</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REF_BOTH_EDGES</name>
              <description>Use both edges of the synchronized signal.  Must be used when REF_DIV2_EN=1, can be used optionally when it is 0.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FILTER_MODE</name>
              <description>Select the transfer function for the (IIR) feedback filter:
0: out[i] = in[i]
1: out[i] = in[i] + out[i-1]
2: out[i] = in[i] + 2*out[i-1] - out[i-2]</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Master enable for DPLL.  Setting ENABLE=1 will startup the tracking DPLL.  No output clock will be generated until the frequency lock has been established.  The status of the DPLL can be observed in the DPLL_STATUS register.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPLL_STATUS</name>
          <description>DPLL Status Register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>OVERFLOW</name>
              <description>The accumulator has overflowed and wrapped around. The DPLL will continue to run and generated output clock, but with (severely) reduced accuracy.  This bit is sticky and must be cleared by firmware.  This condition should never happen under normal circumstances and is indicative of excessive input clock jitter or invalid parameter settings.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UNDERFLOW</name>
              <description>The accumulator has underflowed and wrapped around. The DPLL will continue to run and generated output clock, but with (severely) reduced accuracy.  This bit is sticky and must be cleared by firmware.  This condition should never happen under normal circumstances and is indicative of excessive input clock jitter or invalid parameter settings.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REF_LOCKED</name>
              <description>Indicates whether the DPLL has locked to the input reference.
0: Not locked.  No output clock is generated.
1: Locked. Output clock is being generated.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPLL_L</name>
          <description>DPLL L Parameter</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>L</name>
              <description>Dithering input divider fact.  The input divider divides by L or (L-1) depending on the accumulator/filter feedback.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPLL_N</name>
          <description>DPLL N Parameter</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>N</name>
              <description>Accumulator contribution for each input clock cycle in the reference clock period.  Used to calculate N*C, where C is the number of cycles in the reference clock period.  This term is added to the accumulator on every output clock period.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPLL_M</name>
          <description>DPLL M Parameter</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>M</name>
              <description>Accumulator contribution for each input clock cycle in the output clock period.  Subtracted from CLK_DPLL_LM to calculate (L-1)*M when output clock period is L-1 cycles long.  This term is subtracted from the accumulator on every output clock period.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPLL_LM</name>
          <description>DPLL L*M Parameter</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFF</resetMask>
          <fields>
            <field>
              <name>LM</name>
              <description>Accumulator contribution for each output clock period.  This value must be equal to CLK_DPLL_L * CLK_DPLL_M.</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPLL_T</name>
          <description>DPLL T Parameter</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFF</resetMask>
          <fields>
            <field>
              <name>T</name>
              <description>Quantizer value.  The dithering divider divides by L-1 if filter output is &lt;CLK_DPLL_T, and by L if filter output is &gt;=CLK_DPLL_T.</description>
              <bitRange>[23:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPLL_R</name>
          <description>DPLL R Parameter</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>R</name>
              <description>This is the magnitude of the random noise component added to the accumulator on every output clock cycle.  Either +R or -R is added depending on the output of a 12-bit LFSR.  The interpretation of this LFSR alternates back and forth (0=+R/1=-R and 0=-R/1=+R) to ensure that no DC noise component is added to the accumulator over time.
The 12-bit pseudo-random LFSR has a generator polynomial (x^12+x^11+x^10+x^4+1).  This polynomial has period 4095 (it does not produce the value 12'b0), which means that the total period of the pseudo-random sequence is 8190 output clock cycles.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPLL_P</name>
          <description>DPLL P Parameter</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <resetMask>0x800000FF</resetMask>
          <fields>
            <field>
              <name>P</name>
              <description>Pull component.  This number is sign-extended and added on each output clock cycle to the accumulator.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ACCEPTED</name>
              <description>When a new P value is written set this bit to 1 to clear this bit. 
0: The value for P in this register is being synchronized to the DPLL.  Do not write to this register unless ENABLE=0
1: The value for P in this register has been accepted by the DPLL logic.  Another value can be written.  It takes 2-3 cycles of the DPLL input clock and 2-3 cycles of the system clock for synchronization to happen.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCINTF_CTL</name>
          <description>Oscillator Interface Control</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>PORT_SEL</name>
              <description>Oscillator Interface Port Select
0: USB Selected
1: WCO Selected</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WCO_TRIM</name>
          <description>WCO Trim Register</description>
          <addressOffset>0xFF00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0x37</resetMask>
          <fields>
            <field>
              <name>XGM</name>
              <description>Amplifier GM setting
0x0 - 3370 nA
0x1 - 2620 nA
0x2 - 2250 nA
0x3 - 1500 nA
0x4 - 1870 nA
0x5 - 1120 nA
0x6 -  750 nA
0x7 -      0 nA</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LPM_GM</name>
              <description>GM setting for LPM (bandwidth = DC/ms)</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
