cmsis-svd/cmsis-svd/data/Infineon/psoc4200l.svd
        <register>
          <name>PLL0_TRIM</name>
          <description>PLL #0 Trim Register</description>
          <addressOffset>0xFF04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x12</resetValue>
          <resetMask>0x3F</resetMask>
          <fields>
            <field>
              <name>VCO_GAIN</name>
              <description>Programmable VCO frequency characteristic at high freq - set to &lt;10&gt;</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK_WINDOW</name>
              <description>Selects the allowed phase error before declaring the PLL Unlocked</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DELAY_25NS</name>
                  <description>Delay 25 ns</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_50NS</name>
                  <description>Delay 50 ns</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_75NS</name>
                  <description>Delay 75 ns</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_100NS</name>
                  <description>Delay 100 ns</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_DELAY</name>
              <description>Selects the number of PLL phase frequency detector cycles that the phase error must be in range before declaring lock. (PFD clock cycle = Clock Reference Period/REFERENCE_DIV)</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PFD_CLK_16</name>
                  <description>16 PFD clock cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PFD_CLK_32</name>
                  <description>32 PFD clock cycles</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PFD_CLK_48</name>
                  <description>48 PFD clock cycles</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PFD_CLK_64</name>
                  <description>64 PFD clock cycles</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL1_TRIM</name>
          <description>PLL #1 Trim Register</description>
          <addressOffset>0xFF08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x12</resetValue>
          <resetMask>0x3F</resetMask>
          <fields>
            <field>
              <name>VCO_GAIN</name>
              <description>Programmable VCO frequency characteristic at high freq - set to &lt;10&gt;</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK_WINDOW</name>
              <description>Selects the allowed phase error before declaring the PLL Unlocked</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DELAY_25NS</name>
                  <description>Delay 25 ns</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_50NS</name>
                  <description>Delay 50 ns</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_75NS</name>
                  <description>Delay 75 ns</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DELAY_100NS</name>
                  <description>Delay 100 ns</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_DELAY</name>
              <description>Selects the number of PLL phase frequency detector cycles that the phase error must be in range before declaring lock. (PFD clock cycle = Clock Reference Period/REFERENCE_DIV)</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PFD_CLK_16</name>
                  <description>16 PFD clock cycles</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PFD_CLK_32</name>
                  <description>32 PFD clock cycles</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PFD_CLK_48</name>
                  <description>48 PFD clock cycles</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PFD_CLK_64</name>
                  <description>64 PFD clock cycles</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ECO_TRIM0</name>
          <description>ECO Trim0 Register</description>
          <addressOffset>0xFF0C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1F</resetMask>
          <fields>
            <field>
              <name>WDTRIM</name>
              <description>Watch Dog Trim -  Delta voltage below stead state level
0x0 - 0.05V
0x1 - 0.1V
0x2 - 0.15V
0x3 - 0.2V</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ATRIM</name>
              <description>Amplitude trim to set the crystal drive level when ECO_CONFIG.AGC_EN=1.  WARNING: use care when setting this field because driving a crystal beyond its rated limit can permanently damage the crystal.
0x0 - 0.3Vpp
0x1 - 0.4Vpp
0x2 - 0.5Vpp
0x3 - 0.6Vpp
0x4 - 0.7Vpp
0x5 - 0.8Vpp
0x6 - 0.9Vpp
0x7 - 1.0Vpp</description>
              <bitRange>[4:2]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECO_TRIM1</name>
          <description>ECO Trim1 Register</description>
          <addressOffset>0xFF10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x15</resetValue>
          <resetMask>0x3F</resetMask>
          <fields>
            <field>
              <name>FTRIM</name>
              <description>Filter Trim - 3rd harmonic oscillation</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RTRIM</name>
              <description>Feedback resistor Trim</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GTRIM</name>
              <description>Gain Trim - Startup time</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ECO_TRIM2</name>
          <description>ECO Trim2 Register</description>
          <addressOffset>0xFF14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x20</resetValue>
          <resetMask>0x3F</resetMask>
          <fields>
            <field>
              <name>ITRIM</name>
              <description>Current Trim</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
