cmsis-svd/cmsis-svd/data/Infineon/psoc4200l.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WCO</name>
      <description>32KHz Oscillator</description>
      <baseAddress>0x40220000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>65536</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CONFIG</name>
          <description>WCO Configuration Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x470002</resetValue>
          <resetMask>0xC0FF0007</resetMask>
          <fields>
            <field>
              <name>LPM_EN</name>
              <description>Force block into Low Power Mode:
0: Do not force low power mode (LPM) on
1: Force low power mode (LPM) on</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LPM_AUTO</name>
              <description>Automatically control low power mode (only relevant when LPM_EN=0):
0: Do not enter low power mode (LPM) in DeepSleep
1: Enter low power mode (LPM) in DeepSleep. The logic monitors !act_power_en to determine the device has entered DeepSleep.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EXT_INPUT_EN</name>
              <description>Disables the load resistor and allows external clock input for pad_xin</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENBUS</name>
              <description>Test Mode Control bits
enbus[7] - N/A
enbus[6] - 1=enable both primary Beta Multipliers
enbus[5] - N/A
enbus[4] - N/A
enbus[3] - Load Resistor Control
enbus[2] - Load Resistor Control
enbus[1] - Load Resistor Control
enbus[0] - Load Resistor Control</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DPLL_ENABLE</name>
              <description>Enable DPLL operation. The Oscillator is specified to be stable after 500 ms thus the DPLL should be asserted no sooner than that after IP_ENABLE is set.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IP_ENABLE</name>
              <description>Master enable for IP - disables both WCO and DPLL</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>WCO Status Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>OUT_BLNK_A</name>
              <description>Indicates that output has transitioned - This bit is intended for Test Mode Only and is not a reliable indicator.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPLL</name>
          <description>WCO DPLL Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3FC00000</resetValue>
          <resetMask>0x3FFF07FF</resetMask>
          <fields>
            <field>
              <name>DPLL_MULT</name>
              <description>Multiplier to determine IMO frequency in multiples of the WCO frequency

Fimo = (DPLL_MULT + 1)  * Fwco</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DPLL_LF_IGAIN</name>
              <description>DPLL Loop Filter Integral Gain Setting
0x0 - 0.0625
0x1 - 0.125
0x2 - 0.25
0x3 - 0.5
0x4 - 1.0
0x5 - 2.0
0x6 - 4.0
0x7 - 8.0</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DPLL_LF_PGAIN</name>
              <description>DPLL Loop Filter Proportionial Gain Setting
0x0 - 0.0625
0x1 - 0.125
0x2 - 0.25
0x3 - 0.5
0x4 - 1.0
0x5 - 2.0
0x6 - 4.0
0x7 - 8.0</description>
              <bitRange>[21:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DPLL_LF_LIMIT</name>
              <description>Maximum IMO offset allowed (used to prevent DPLL dynamics from selecting an IMO frequency that the logic cannot support)</description>
              <bitRange>[29:22]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIM</name>
          <description>WCO Trim Register</description>
          <addressOffset>0xF00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2211</resetValue>
          <resetMask>0x3737</resetMask>
          <fields>
            <field>
              <name>XGM</name>
              <description>Amplifier GM setting - Used when WCO.LPM_AUTO=0 or when LPM_AUTO=1 and not in DeepSleep mode.
0x0 - 3370 nA
0x1 - 2620 nA
0x2 - 2250 nA
0x3 - 1500 nA
0x4 - 1870 nA
0x5 - 1120 nA
0x6 -  750 nA
0x7 -      0 nA</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LPM_GM</name>
              <description>GM setting for LPM (bandwidth = DC/ms)  - Used when WCO.LPM_AUTO=0 or when LPM_AUTO=1 and not in DeepSleep mode.</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XGM_FOR_LPM_AUTO</name>
              <description>Amplifier GM setting - Used when WCO.LPM_AUTO=1 and in DeepSleep mode
0x0 - 3370 nA
0x1 - 2620 nA
0x2 - 2250 nA
0x3 - 1500 nA
0x4 - 1870 nA
0x5 - 1120 nA
0x6 -  750 nA
0x7 -      0 nA</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LPM_GM_FOR_LPM_AUTO</name>
              <description>GM setting for LPM (bandwidth = DC/ms) - Used when WCO.LPM_AUTO=1 and in DeepSleep mode</description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
