cmsis-svd/cmsis-svd/data/Infineon/psoc4200l.svd
        <register>
          <name>ARB_EP7_CFG</name>
          <description>Endpoint Configuration Register</description>
          <addressOffset>0x380</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>IN_DATA_RDY</name>
              <description>Indication that Endpoint Packet Data is Ready in Main memory</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_REQ</name>
              <description>Manual DMA Request for a particular (1 to 8) endpoint; changing this field from 0 to 1 causes a DMA request to be generated.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CRC_BYPASS</name>
              <description>Configuration Setting to prevent CRC bytes from being written to memory and being read by firmware</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRC_NORMAL</name>
                  <description>No CRC bypass; CRC bytes will be written to memory and Termin will be generated for the CRC byte/s</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_BYPASS</name>
                  <description>CRC Bypass Set; CRC bytes will not be written into memory and Termin will be generated for the last data byte/s</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESET_PTR</name>
              <description>Configuration Setting to Reset the RA and WA Pointers to their start values at the End of Packet transaction.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESET_KRYPTON</name>
                  <description>Do not Reset Pointer; Krypton Backward compatibility mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET_NORMAL</name>
                  <description>Reset Pointer; recommended value for reduction of CPU Configuration Writes.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_EP7_INT_EN</name>
          <description>Endpoint Interrupt Enable Register</description>
          <addressOffset>0x384</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F</resetMask>
          <fields>
            <field>
              <name>IN_BUF_FULL_EN</name>
              <description>IN Endpoint Local Buffer Full Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_GNT_EN</name>
              <description>Endpoint DMA Grant Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BUF_OVER_EN</name>
              <description>Endpoint Buffer Overflow Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BUF_UNDER_EN</name>
              <description>Endpoint Buffer Underflow Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ERR_INT_EN</name>
              <description>Endpoint Error in Transaction Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_TERMIN_EN</name>
              <description>Endpoint DMA Terminated Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_EP7_SR</name>
          <description>Endpoint Interrupt Enable Register</description>
          <addressOffset>0x388</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x2F</resetMask>
          <fields>
            <field>
              <name>IN_BUF_FULL</name>
              <description>IN Endpoint Local Buffer Full Interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_GNT</name>
              <description>Endpoint DMA Grant Interrupt</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BUF_OVER</name>
              <description>Endpoint Buffer Overflow Interrupt</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BUF_UNDER</name>
              <description>Endpoint Buffer Underflow Interrupt</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_TERMIN</name>
              <description>Endpoint DMA Terminated Interrupt</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_RW7_WA</name>
          <description>Endpoint Write Address value</description>
          <addressOffset>0x390</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>WA</name>
              <description>Write Address for EP</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_RW7_WA_MSB</name>
          <description>Endpoint Write Address value</description>
          <addressOffset>0x394</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WA_MSB</name>
              <description>Write Address for EP</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_RW7_RA</name>
          <description>Endpoint Read Address value</description>
          <addressOffset>0x398</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>RA</name>
              <description>Read Address for EP</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_RW7_RA_MSB</name>
          <description>Endpoint Read Address value</description>
          <addressOffset>0x39C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>RA_MSB</name>
              <description>Read Address for EP</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_RW7_DR</name>
          <description>Endpoint Data Register</description>
          <addressOffset>0x3A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DR</name>
              <description>Data Register for EP ; This register is linked to the memory, hence reset value is undefined</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_EP8_CFG</name>
          <description>Endpoint Configuration Register</description>
          <addressOffset>0x3C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xF</resetMask>
          <fields>
            <field>
              <name>IN_DATA_RDY</name>
              <description>Indication that Endpoint Packet Data is Ready in Main memory</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_REQ</name>
              <description>Manual DMA Request for a particular (1 to 8) endpoint; changing this field from 0 to 1 causes a DMA request to be generated.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CRC_BYPASS</name>
              <description>Configuration Setting to prevent CRC bytes from being written to memory and being read by firmware</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRC_NORMAL</name>
                  <description>No CRC bypass; CRC bytes will be written to memory and Termin will be generated for the CRC byte/s</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC_BYPASS</name>
                  <description>CRC Bypass Set; CRC bytes will not be written into memory and Termin will be generated for the last data byte/s</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESET_PTR</name>
              <description>Configuration Setting to Reset the RA and WA Pointers to their start values at the End of Packet transaction.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESET_KRYPTON</name>
                  <description>Do not Reset Pointer; Krypton Backward compatibility mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET_NORMAL</name>
                  <description>Reset Pointer; recommended value for reduction of CPU Configuration Writes.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_EP8_INT_EN</name>
          <description>Endpoint Interrupt Enable Register</description>
          <addressOffset>0x3C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F</resetMask>
          <fields>
            <field>
              <name>IN_BUF_FULL_EN</name>
              <description>IN Endpoint Local Buffer Full Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_GNT_EN</name>
              <description>Endpoint DMA Grant Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BUF_OVER_EN</name>
              <description>Endpoint Buffer Overflow Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BUF_UNDER_EN</name>
              <description>Endpoint Buffer Underflow Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ERR_INT_EN</name>
              <description>Endpoint Error in Transaction Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_TERMIN_EN</name>
              <description>Endpoint DMA Terminated Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_EP8_SR</name>
          <description>Endpoint Interrupt Enable Register</description>
          <addressOffset>0x3C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x2F</resetMask>
          <fields>
            <field>
              <name>IN_BUF_FULL</name>
              <description>IN Endpoint Local Buffer Full Interrupt</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_GNT</name>
              <description>Endpoint DMA Grant Interrupt</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BUF_OVER</name>
              <description>Endpoint Buffer Overflow Interrupt</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BUF_UNDER</name>
              <description>Endpoint Buffer Underflow Interrupt</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_TERMIN</name>
              <description>Endpoint DMA Terminated Interrupt</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_RW8_WA</name>
          <description>Endpoint Write Address value</description>
          <addressOffset>0x3D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>WA</name>
              <description>Write Address for EP</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_RW8_WA_MSB</name>
          <description>Endpoint Write Address value</description>
          <addressOffset>0x3D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>WA_MSB</name>
              <description>Write Address for EP</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_RW8_RA</name>
          <description>Endpoint Read Address value</description>
          <addressOffset>0x3D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>RA</name>
              <description>Read Address for EP</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_RW8_RA_MSB</name>
          <description>Endpoint Read Address value</description>
          <addressOffset>0x3DC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>RA_MSB</name>
              <description>Read Address for EP</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_RW8_DR</name>
          <description>Endpoint Data Register</description>
          <addressOffset>0x3E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DR</name>
              <description>Data Register for EP ; This register is linked to the memory, hence reset value is undefined</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>512</dim>
          <dimIncrement>4</dimIncrement>
          <name>MEM_DATA[%s]</name>
          <description>DATA</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DR</name>
              <description>Data Register for EP ; This register is linked to the memory, hence reset value is undefined</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SOF16</name>
          <description>Start Of Frame Register</description>
          <addressOffset>0x1060</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7FF</resetMask>
          <fields>
            <field>
              <name>FRAME_NUMBER16</name>
              <description>The frame number (11b)</description>
              <bitRange>[10:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OSCLK_DR16</name>
          <description>Oscillator lock data register</description>
          <addressOffset>0x1080</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>ADDER16</name>
              <description>These bits return the oscillator locking circuits adder output.</description>
              <bitRange>[14:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_RW1_WA16</name>
          <description>Endpoint Write Address value</description>
          <addressOffset>0x1210</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1FF</resetMask>
          <fields>
            <field>
              <name>WA16</name>
              <description>Write Address for EP</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_RW1_RA16</name>
          <description>Endpoint Read Address value</description>
          <addressOffset>0x1218</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1FF</resetMask>
          <fields>
            <field>
              <name>RA16</name>
              <description>Read Address for EP</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_RW1_DR16</name>
          <description>Endpoint Data Register</description>
          <addressOffset>0x1220</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DR16</name>
              <description>Data Register for EP ; This register is linked to the memory, hence reset value is undefined</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_RW2_WA16</name>
          <description>Endpoint Write Address value</description>
          <addressOffset>0x1250</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1FF</resetMask>
          <fields>
            <field>
              <name>WA16</name>
              <description>Write Address for EP</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_RW2_RA16</name>
          <description>Endpoint Read Address value</description>
          <addressOffset>0x1258</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1FF</resetMask>
          <fields>
            <field>
              <name>RA16</name>
              <description>Read Address for EP</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
