cmsis-svd/cmsis-svd/data/Infineon/psoc4200l.svd
        <register>
          <name>ARB_RW2_DR16</name>
          <description>Endpoint Data Register</description>
          <addressOffset>0x1260</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DR16</name>
              <description>Data Register for EP ; This register is linked to the memory, hence reset value is undefined</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_RW3_WA16</name>
          <description>Endpoint Write Address value</description>
          <addressOffset>0x1290</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1FF</resetMask>
          <fields>
            <field>
              <name>WA16</name>
              <description>Write Address for EP</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_RW3_RA16</name>
          <description>Endpoint Read Address value</description>
          <addressOffset>0x1298</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1FF</resetMask>
          <fields>
            <field>
              <name>RA16</name>
              <description>Read Address for EP</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_RW3_DR16</name>
          <description>Endpoint Data Register</description>
          <addressOffset>0x12A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DR16</name>
              <description>Data Register for EP ; This register is linked to the memory, hence reset value is undefined</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CWA16</name>
          <description>Common Area Write Address</description>
          <addressOffset>0x12B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1FF</resetMask>
          <fields>
            <field>
              <name>CWA16</name>
              <description>Write Address for Common Area</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_RW4_WA16</name>
          <description>Endpoint Write Address value</description>
          <addressOffset>0x12D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1FF</resetMask>
          <fields>
            <field>
              <name>WA16</name>
              <description>Write Address for EP</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_RW4_RA16</name>
          <description>Endpoint Read Address value</description>
          <addressOffset>0x12D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1FF</resetMask>
          <fields>
            <field>
              <name>RA16</name>
              <description>Read Address for EP</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_RW4_DR16</name>
          <description>Endpoint Data Register</description>
          <addressOffset>0x12E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DR16</name>
              <description>Data Register for EP ; This register is linked to the memory, hence reset value is undefined</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_THRES16</name>
          <description>DMA Burst / Threshold Configuration</description>
          <addressOffset>0x12F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1FF</resetMask>
          <fields>
            <field>
              <name>DMA_THS16</name>
              <description>DMA Threshold count</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_RW5_WA16</name>
          <description>Endpoint Write Address value</description>
          <addressOffset>0x1310</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1FF</resetMask>
          <fields>
            <field>
              <name>WA16</name>
              <description>Write Address for EP</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_RW5_RA16</name>
          <description>Endpoint Read Address value</description>
          <addressOffset>0x1318</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1FF</resetMask>
          <fields>
            <field>
              <name>RA16</name>
              <description>Read Address for EP</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_RW5_DR16</name>
          <description>Endpoint Data Register</description>
          <addressOffset>0x1320</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DR16</name>
              <description>Data Register for EP ; This register is linked to the memory, hence reset value is undefined</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_RW6_WA16</name>
          <description>Endpoint Write Address value</description>
          <addressOffset>0x1350</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1FF</resetMask>
          <fields>
            <field>
              <name>WA16</name>
              <description>Write Address for EP</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_RW6_RA16</name>
          <description>Endpoint Read Address value</description>
          <addressOffset>0x1358</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1FF</resetMask>
          <fields>
            <field>
              <name>RA16</name>
              <description>Read Address for EP</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_RW6_DR16</name>
          <description>Endpoint Data Register</description>
          <addressOffset>0x1360</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DR16</name>
              <description>Data Register for EP ; This register is linked to the memory, hence reset value is undefined</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_RW7_WA16</name>
          <description>Endpoint Write Address value</description>
          <addressOffset>0x1390</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1FF</resetMask>
          <fields>
            <field>
              <name>WA16</name>
              <description>Write Address for EP</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_RW7_RA16</name>
          <description>Endpoint Read Address value</description>
          <addressOffset>0x1398</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1FF</resetMask>
          <fields>
            <field>
              <name>RA16</name>
              <description>Read Address for EP</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_RW7_DR16</name>
          <description>Endpoint Data Register</description>
          <addressOffset>0x13A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DR16</name>
              <description>Data Register for EP ; This register is linked to the memory, hence reset value is undefined</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_RW8_WA16</name>
          <description>Endpoint Write Address value</description>
          <addressOffset>0x13D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1FF</resetMask>
          <fields>
            <field>
              <name>WA16</name>
              <description>Write Address for EP</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_RW8_RA16</name>
          <description>Endpoint Read Address value</description>
          <addressOffset>0x13D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1FF</resetMask>
          <fields>
            <field>
              <name>RA16</name>
              <description>Read Address for EP</description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARB_RW8_DR16</name>
          <description>Endpoint Data Register</description>
          <addressOffset>0x13E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0</resetMask>
          <fields>
            <field>
              <name>DR16</name>
              <description>Data Register for EP ; This register is linked to the memory, hence reset value is undefined</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <cluster>
          <name>USB</name>
          <description>USB Device Controller Battery Charger Detect</description>
          <addressOffset>0x00002000</addressOffset>
          <register>
            <name>POWER_CTRL</name>
            <description>Power Control Register</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x4000010</resetValue>
            <resetMask>0xFE00007F</resetMask>
            <fields>
              <field>
                <name>VBUS_VALID_OVR</name>
                <description>Overrides the value received from the GPIO input buffer connected to VBUS:
0: Force vbus_valid=0
1: Force vbus_valid=1
2: Use vbus_valid signal from GPIO input
3: Use vbus_valid signal from PHY detector</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SUSPEND</name>
                <description>Put PHY into Suspend mode.  If the PHY is enabled, this bit MUST be set before entering a low power mode (DeepSleep/Hibernate).</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SUSPEND_DEL</name>
                <description>Delayed version of SUSPEND.  Always set SUSPEND and SUSPEND_DEL together in a single register write.  When taking PHY out of suspend mode, first clear SUSPEND, then clear SUSPEND_DEL at least 2us later.</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ISOLATE</name>
                <description>Isolates the PHY outputs.  Clear this bit at least 2us after vbus is known to be valid (vbus_valid=1).  Isolation will be forced when vbus_valid goes low (see VBUS_VALID_OVR).</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CHDET_PWR_CTL</name>
                <description>Power programmability for bandgap voltage buffer in the charger detect block.  See s8bg_vrefbuf public cell for more information.  Default '0' is low power mode.</description>
                <bitRange>[6:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ENABLE_DM_PULLDOWN</name>
                <description>Enables the ~15k pull down on the DM, default off. The 15k pull down is needed for Data Contact Detection (DCD).</description>
                <bitRange>[25:25]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ENABLE_VBUS_PULLDOWN</name>
                <description>Enables the weak pull down on the VBUS, default on, to prevent floating node crow bar currents.</description>
                <bitRange>[26:26]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ENABLE_RCVR</name>
                <description>Enables the differential USB receiver.</description>
                <bitRange>[27:27]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ENABLE_DPO</name>
                <description>Enables the single ended receiver on D+.</description>
                <bitRange>[28:28]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ENABLE_DMO</name>
                <description>Enables the signle ended receiver on D-.</description>
                <bitRange>[29:29]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ENABLE_CHGDET</name>
                <description>Enables the charger detection circuitry.  After USB has connected, this circuitry can be disabled to save power.</description>
                <bitRange>[30:30]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ENABLE</name>
                <description>Mast enable of PHY and Charger Detector.  Nothing will work until this bit is set.</description>
                <bitRange>[31:31]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CHGDET_CTRL</name>
            <description>Charger Detection Control Register</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x307F</resetMask>
            <fields>
              <field>
                <name>COMP_DP</name>
                <description>Connect the primary/secondary detection comparator and current sink  to D+</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>COMP_DM</name>
                <description>Connect the primary/secondary detection comparator and current sink  to D-</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>COMP_EN</name>
                <description>Enable the primary/secondary detection comparator and current sink.  This bit can be written concurrently with COMP_DP/COMP_DM.  Note that REF_EN must also be 1 for the comparator to work (because it receives a reference from it).</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>REF_DP</name>
                <description>Connect the primary/secondary detection reference driver to D+</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>REF_DM</name>
                <description>Connect the primary/secondary detection reference driver to D-</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>REF_EN</name>
                <description>Enable the primary/secondary reference driver.  This bit can be written concurrently with REF_DP/REF_DM.</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DCD_SRC_EN</name>
                <description>Enable the Data Contact Detect current source on D+</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADFT_CTRL</name>
                <description>ADFT option to bring out buffered version of voltage reference input or adft intput to ADFT output (adft_out).</description>
                <bitRange>[13:12]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ADFT_NORMAL</name>
                    <description>Normal operating mode, reference buffer used to generate internal references.  adft_out pulled low.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ADFT_VBG</name>
                    <description>Use reference buffer to bring out voltage reference input (vbg) onto adft_out.</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ADFT_DONTUSE</name>
                    <description>Illegal - do not use.</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ADFT_ADFTIN</name>
                    <description>Use reference buffer to bring out buffered version of system level adft input (adft_in) onto adft_out.</description>
                    <value>3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>COMP_OUT</name>
                <description>Output of the primary/secondary detection comparator.  This output is not filtered or debounced and must be polled in software.</description>
                <bitRange>[31:31]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
